Documents/DMS_ЗаявкаНаАвтомобиль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ЗаявкаНаАвтомобиль</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataAra</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NumCl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерDMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерDevis</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВариантыСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЖелаемойПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммерческаяАкция5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Опции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродавецСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемВMyRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаКоммуникацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ЦветаСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОрдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрикрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрепления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннуляции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычнаяСделка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конверсия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лизинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кузовостроитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛизинговаяКомпания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерепродажаОформлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемВКорпПортале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокиДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентрализованныйКонтракт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/DMS_ТипыАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыАвтомобилей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>VP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VU</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ЗаявкаНаАвтомобиль/Forms/ФормаГрупповогоПодбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивОтветов") Тогда
		
		МассивОтветов = Параметры.МассивОтветов;
		
		Для каждого эл Из МассивОтветов Цикл
			
			Нстр = Автомобили.Добавить();		
			ЗаполнитьЗначенияСвойств(Нстр, эл);
			Если эл.Свойство("Ответ") Тогда
				сОтвет = эл.Ответ;
				Если ЗначениеЗаполнено(сОтвет) И сОтвет.Свойство("Модель") Тогда // DMSREN-1183
					Нстр.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", сОтвет.Модель);
					Если сОтвет.Свойство("Версия") Тогда
						Нстр.Версия = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул",сОтвет.Версия,,Нстр.Модель);   // DMSREN-785
					КонецЕсли;
					Нстр.Цвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул",сОтвет.Цвет);
					ЦветСалона = Справочники.DMS_ЦветаСалона.НайтиПоРеквизиту("Артикул",сОтвет.ЦветСалона);
					Если ЦветСалона = Справочники.DMS_ЦветаСалона.ПустаяСсылка() и ЗначениеЗаполнено(сОтвет.ЦветСалона) тогда
						НовыйЦветСалона = Справочники.DMS_ЦветаСалона.СоздатьЭлемент();
						НовыйЦветСалона.Артикул = сОтвет.ЦветСалона;
						НовыйЦветСалона.Наименование = сОтвет.ЦветСалонаНаименование;
						НовыйЦветСалона.Записать();
						ЦветСалона = НовыйЦветСалона.Ссылка;
					КонецЕсли; 
					Нстр.ЦветСалона = ЦветСалона;
					ВариантСалона = Справочники.DMS_ВариантыСалона.НайтиПоРеквизиту("Артикул",сОтвет.ВариантСалона);
					Если ВариантСалона = Справочники.DMS_ВариантыСалона.ПустаяСсылка() и ЗначениеЗаполнено(сОтвет.ВариантСалона) тогда
						НовыйВариант = Справочники.DMS_ВариантыСалона.СоздатьЭлемент();
						НовыйВариант.Артикул = сОтвет.ВариантСалона;
						НовыйВариант.Наименование = сОтвет.ВариантСалонаНаименование;
						НовыйВариант.Записать();
						ВариантыСалона = НовыйВариант.Ссылка;
					КонецЕсли; 
					Нстр.ВариантСалона = ВариантСалона;
					Нстр.ТипАвтомобиля = Перечисления.DMS_ТипыАвтомобилей.VP;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	КонецЕсли;
	
	Если Параметры.Свойство("Автор") Тогда
		Автор = Параметры.Автор;
		Продавец = Параметры.Автор;
	КонецЕсли;
	
	Если Параметры.Свойство("Счет") Тогда
		Счет = Параметры.Счет;
	КонецЕсли;
	
	Если Параметры.Свойство("ДилерскийЦентр") Тогда
		ДилерскийЦентр = Параметры.ДилерскийЦентр;
	КонецЕсли;
	
	ЗаполнитьСписокКоммерческихАкцийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКоммерческихАкцийНаСервере()

	ТабАкций = Новый ТаблицаЗначений;
	ТабАкций.Колонки.Добавить("Акция");	
	ТабАкций.Колонки.Добавить("Количество");
	
	Для каждого стр Из Автомобили Цикл
	
		СписокДоступныхКоммерческихАкций = DMS_ОбменДаннымиСДилерскимПорталом.ВернутьСписокДоступныхКоммерческихАкций(стр.VIN);
		
		Для каждого эл Из СписокДоступныхКоммерческихАкций Цикл
		    нстр = ТабАкций.Добавить();
			нстр.Акция = эл.Значение;
		    нстр.Количество = 1;
		КонецЦикла;
		
	КонецЦикла;
	
	ТабАкций.Свернуть("Акция","Количество");
	
	КоличествоАвто = Автомобили.Количество();
	
	МассивОдинаковыхАкций = Новый Массив;
	
	Для каждого стр Из ТабАкций Цикл
	    Если стр.Количество = КоличествоАвто Тогда
		    МассивОдинаковыхАкций.Добавить(стр.Акция);		
		КонецЕсли;	
	КонецЦикла;
	
	ЭтаФорма.Элементы.КоммерческаяАкция1.СписокВыбора.ЗагрузитьЗначения(МассивОдинаковыхАкций);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкиНаСервере()
	
	CRM_КлиентскаяЗаявка = Документы.DMS_ЗаявкаНаАвтомобиль; 
	
	Для каждого стр Из Автомобили Цикл
		если ЗначениеЗаполнено(стр.ЗаявкаНаАвтомобиль) тогда // DMSREN-1183
			Продолжить;
		КонецЕсли;
			
		ДокОбъект 						= CRM_КлиентскаяЗаявка.СоздатьДокумент();
		ДокОбъект.Дата 					= ТекущаяДата();
		ДокОбъект.Автор 				= Автор;
		ДокОбъект.Продавец 				= Продавец;
		ДокОбъект.КоммерческаяАкция1	= КоммерческаяАкция1;
		ДокОбъект.ДатаЖелаемойПоставки 	= ДатаЖелаемойПоставки;
		ДокОбъект.Счет 					= Счет;
		ДокОбъект.ДилерскийЦентр 		= ДилерскийЦентр;
		ДокОбъект.ТипЗаявки 			= ТипЗаявки;
		ДокОбъект.ОбычнаяСделка 		= ОбычнаяСделка;
		ДокОбъект.Конверсия 			= Конверсия;
		ДокОбъект.Лизинг 				= Лизинг;

		ДокОбъект.VIN 					= стр.VIN;
	    ДокОбъект.Модель				= стр.Модель;
		ДокОбъект.Версия 				= стр.Версия;
		ДокОбъект.Цвет 					= стр.Цвет;
		ДокОбъект.ВариантСалона 		= стр.ВариантСалона;
		ДокОбъект.ЦветСалона 			= стр.ЦветСалона;
		ДокОбъект.ТипАвтомобиля 		= стр.ТипАвтомобиля;
		ДокОбъект.ДоговорКП 			= стр.ДоговорКП;
		ДокОбъект.Клиент 				= стр.Клиент;
		попытка
			ДокОбъект.Записать();
		исключение
			Продолжить;
		КонецПопытки;
		стр.ЗаявкаНаАвтомобиль = ДокОбъект.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявки(Команда)
	СоздатьЗаявкиНаСервере();
КонецПроцедуры
